"""Дана строка:
String s = “Перевыборы выбранного президента”;
необходимо подсчитать количество букв “е” в строке.
Для указанной строки ответ будет 4.
"""
s = "Перевыборы выбранного президента"
output=[]
for i in s:
    if i == "е":
        output.append((i))
print(len(output)
)