"""Дана строка:
String s = “Перестановочный алгоритм быстрого действия”;
необходимо вывести все буквы “о” из этой строки.
Для указанной строки ответ будет “ооооо” (или в столбик)
"""
output=[]
s = "Перестановочный алгоритм быстрого действия"
for i in s:
    if i == "о":
        output.append(i)
print("".join(output))